/*************************************************************************
	> File Name: 125-1.c
	> Author:jiangxiaoyu 
	> Mail:2291372880@qq.com 
	> Created Time: 2019年06月30日 星期日 10时07分23秒
 ************************************************************************/

#include <stdio.h>
#include <iostream>
using namespace std;

int main() {
    int h, m, s, t;
    cin >> h >> m >> s >> t;
    int t1 = h * 3600 + m * 60 + s + t;
    if (t1 >= 86400) {
        t1 -= 86400;
    }
    if (t1 < 43200) {
        if (t1 < 3600) t1 += 43200;
        cout << t1 / 3600 << ":" << t1 % 3600 / 60 << ":" << t1 % 60 << "am" << endl;
    } else {
        t1 -= 43200;
        if (t1 < 3600) {
            t1 += 43200;
        }
        cout << t1 / 3600 << ":" << t1 % 3600 / 60 << ":" << t1 % 60 << "pm" << endl;
    }
    printf("%.2lf%%\n", t / 86400.0 * 100);
    //cout << t1 / 86400.0 * 100 << % << endl; 
    return 0;
}
